{
  "termsOfUseId": 20704,
  "title": "Standard Reviewer Terms v1.0",
  "url": "",
  "text": "<h3>Standard Reviewer Terms (Version 1.0)</h3>\r\n\r\n<p>THESE ARE THE TERMS AND CONDITIONS (\"TERMS\") UNDER WHICH YOU AGREE TO WORK UNDER AS A TOPCODER REVIEW BOARD MEMBER.  THESE TERMS AND CONDITIONS AFFECT YOUR RIGHTS AND YOU SHOULD READ THEM CAREFULLY BEFORE AGREEING TO THEM.  IN THESE TERMS AND CONDITIONS, \"WE,\" \"US,\" \"ITS\" AND \"OUR\" REFER TO TOPCODER, INC. AND \"YOU\" AND \"YOUR\" REFER TO YOU. </p>\r\n\r\n<p>It is understood that We need, and You have, expertise in evaluating and critiquing software designs and/or software development solutions.  Furthermore, You agree that You are ready, willing, and able to undertake the performance of evaluating and critiquing such software designs and/or software development solutions submitted to Us, and You agree to assign and transfer your rights as a result of performing such services.</p>\r\n\r\n<p>In consideration of the premises and the mutual promises and covenants set forth herein, and for other good and valuable consideration, the receipt and sufficiency of which are hereby acknowledged, the parties agree as follows:</p>\r\n\r\n<h4>1.0\tDefinitions:</h4>\r\n<p>As used in these Terms, the following capitalized terms shall have the following meanings unless otherwise indicated:</p>\r\n\r\n<p>1.1.\t\"Development(s)\" shall mean any idea, design, concept, development, component, algorithm, process, method, formula, code, software, technique, technology, discovery or improvement, whether or not patentable, made, conceived, created, discovered, invented or reduced to practice by You in connection with the performance of services hereunder. </p>\r\n\r\n<p>1.2.\t\"Intellectual Property Rights\" shall mean all intellectual property rights worldwide arising under statutory or common law or by contract and whether or not perfected, now existing or hereafter filed, issued or acquired, including all patent rights; all rights associated with works of authorship including copyrights and moral rights; rights relating to the protection of trade secrets and confidential information; and any right analogous to those set forth herein and any other proprietary rights relating to intangible property, other than Trademarks.</p>\r\n\r\n<p>1.3.\t\"TopCoder Information\" shall mean TopCoder's and TopCoder Software's specifications, descriptions, architecture, plans, interfaces, and code for TopCoder's and TopCoder Software's hardware, software, and web site; TopCoder's competitions and competition operation procedures; TopCoder's and TopCoder Software's business and operational plans; and derivatives of the foregoing.  The TopCoder Information shall be Confidential Information hereunder.</p>\r\n\r\n<p>1.4.\t\"Software Component\" shall mean all software and related materials, technology and documentation (including without limitation design documents, source code and object code) to be evaluated and assessed by You for Us hereunder in accordance with our requirements, as set forth herein and in other documents provided by Us.  The Software Component shall be Confidential Information hereunder.</p>\r\n\r\n<h4>2.\tServices:</h4>\r\n\r\n<p>2.1\tYou hereby agree to provide services relating to the evaluation and assessment of the Software Component.  You agree to perform such services according to and in conformity with the following specifications, in addition to any specifications and/or scheduled provided by Us in our sole discretion (the \"Services\"):</p>\r\n\r\n<ul>Architecture Review Board requirements per component project:\r\n<li>If assigned the role of Primary Architect, as designated by Us, You will review all component submissions to check if all required elements are present as defined in the Design Screening Scorecard. If all required elements are present, then the reviewer objectively scores the design on a series of questions in the Design Screening Scorecard. This process will narrow down the component submissions to the top components, which will go on to a more detailed review.</li>\r\n<li>All Architecture Review Board members for a component will fill out a subjective review for each component that passes the screening phase.  This review is performed through a series of questions in the Design Review Scorecard. Each question requires both a score and comments.</li>\r\n<li>The Primary Architect is responsible for aggregating all review comments.  This includes resolving any conflicts between differing architect comments.  The Primary Architect may deem some suggestions as mandatory with our permission.</li>\r\n<li>The Primary Architect is responsible for giving final review to the component submission once the comments have been applied.  This includes ensuring that mandatory suggestions have been implemented, and that all suggestions implemented have been done correctly.</li>\r\n<li>All interaction with designers, our personnel and other Architecture Review Board members should occur in the online forum on www.topcodersoftware.com.</li>\r\n</ul>\r\n\r\n<ul>Development Review Board requirements per component project:\r\n\r\n<li>If assigned the role of Primary Reviewer, as designated by Us, You will review all component submissions to check if all required elements are present as defined in the Development Screening Scorecard. If all required elements are present, then the reviewer objectively scores the development solution on a series of questions in the Development Screening Scorecard. This process will narrow down the component submissions to the top components, which will go on to a more detailed review.</li>\r\n<li>All Development Review Board members for a component will fill out a subjective review for each component that passes the screening phase.  This review is performed through a series of questions in the Development Review Scorecard. Each question requires both a score and comments.  In addition, the reviewers will each be assigned one of the following roles, which defines what type of test cases they are responsible for submitting:</li>\r\n<ul type=\"circle\">\r\n<li>Stress Tester - Develop test cases to stress test component solutions in order to get performance metrics on throughput and capacity.</li>\r\n<li>Accuracy Tester - Develop test cases to test the accuracy of the component.  Each public method should be tested to ensure it returns the expected result.</li>\r\n<li>Failure Tester - Develop test cases to test different input types for all constructor methods and public methods that are not covered in the developer unit test cases or the designer test cases.</li>\r\n</ul>\r\n<li>All interaction with designers, developers, our personnel and other Development Review Board members should occur in the online forum on www.topcodersoftware.com.</li>\r\n</ul>\r\n\r\n<p>2.2\tYou agree to commit sufficient time and resources to perform the Services according to the schedule set forth by Us.  You shall promptly notify Us of any circumstances, as such circumstances arise, that may reasonably be anticipated to lead to a material deviation from the schedule.</p>\r\n\r\n<p>2.3\tYou agree to keep Us updated, promptly upon our request, of any progress, problems, and/or developments of which You are aware regarding the Services.  We shall have the right to require such updates in writing from You in a format specified by Us or acceptable to Us in our sole discretion.  You shall conduct and conclude the Services in a professional manner.</p>\r\n\r\n<h4>3.\tConsideration/Compensation:</h4>\r\n\r\n<p>3.1\tFee.  In consideration for performance of the Services required by You, We shall pay You the fee set forth on TopCoder's website and/or in other correspondence from Us to You (the \"Fee\").  The Fee shall be in U.S. Dollars and may be paid in installments, as set forth on our website or in other correspondence from Us.  The Fee shall be paid upon the conclusion of the review period, and once completed scorecards have been received, provided the completed scorecards are submitted to Us by the deadline as set forth on the website and/or in the correspondence from Us.</p>\r\n\r\n<p>3.2\tRoyalty Payments.</p>\r\n  \r\n<p>(a)\tDefinitions.  As used in this Section 3, the following capitalized terms shall have the following meanings unless otherwise indicated:</p>\r\n<ul>\r\n<li>(i)\t\"Royalty Percentage\" shall mean the percentage of the Royalty Pool to be distributed by Us, at our sole discretion, to all review board members who evaluate the Software Components. </li>\r\n<li>(ii) \"Royalty Pool Percentage\" shall mean the percentage of total revenue We derive from the sale of Software Components.  We, in our sole discretion, shall determine the Royalty Pool Percentage and may modify or amend the Royalty Pool Percentage at any time for any or no reason.  </li>\r\n<li>(iii) \"Royalty Pool\" shall mean the portion of our revenues that We distribute as royalty payments to the designers, architects, developers and quality assurance developers who designed, evaluated, developed and tested the applicable Software Components.  The Royalty Pool shall be determined by multiplying (x) the Royalty Pool Percentage by (y) the total revenues received by Us from licenses of the applicable Software Components during the respective fiscal quarter.  </li>\r\n<li>(iv) \"Revenue Receipt Date\" shall mean the date on which We first receive payment of revenue from licenses of an applicable Software Components.  </li>\r\n</ul>\r\n\r\n<p>(b)\tIn consideration of Your evaluation of the Software Components and performance of Your obligations hereunder, We may pay to You a royalty (the \"Royalty Payment\").  The Royalty Payment to be paid shall be a portion of the Royalty Pool.  The Royalty Pool shall be distributed as follows:</p>\r\n\r\n<ul>\r\n<li>(i)  25% to all Architecture Review Board members.  (This amount will be distributed equally amongst all review board members.)</li>\r\n<li>(ii)  25% to all Development Review Board members.  (This amount will be distributed equally amongst all review board members.)</li>\r\n<li>(iii)  25% to the winning designer</li>\r\n<li>(iv)  25% to the winning developer</li>\r\n</ul>\r\n\r\n<p>3.3\tTotal Payment.  The sum of the Fee and the Royalty Payments shall be the total payment due to You.  Any and all out-of-pocket expenses incurred by You in connection with performing the obligations hereunder are your sole responsibility.  We will not reimburse You for any expenses incurred.</p>\r\n\r\n<p>3.4\tYou shall not be entitled to receive any other compensation or any benefits from Us in connection with the Services.  Except as otherwise required by law, We shall not withhold any sums or payments made to You for social security or other federal, state or local tax liabilities or contributions, and all withholdings, liabilities, and contributions shall be solely your responsibility.  Further, You understand and agree that the Services are not covered under the unemployment compensation laws and are not intended to be covered by workers' compensation laws.</p>\r\n\r\n<h4>4.\tOwnership and Rights:</h4>\r\n\r\n<p>4.1\tYou hereby acknowledge and agree that We own, solely and exclusively, all right, title and interest, including all Intellectual Property Rights, in and to the TopCoder Information.  In addition, You hereby irrevocably and unconditionally transfer and assign to Us all right, title and interest You had, have, may have or acquire in or to all Developments and Software Components, and You agree to execute and deliver such documents, certificates, assignments and other writings, and take such other actions as may be necessary or desirable to vest in Us the ownership rights granted to Us hereunder.</p>\r\n\r\n<p>4.2\tYou further agree that any and all works of authorship created, authored or developed by You hereunder shall be deemed to be \"works made for hire\" within the meaning of the United States Copyright Law and, as such, all rights therein including copyright shall belong solely and exclusively to Us from the time of their creation.  To the extent any such work of authorship may not be deemed to be a work made for hire, You agree to, and do hereby, irrevocably and unconditionally transfer and assign to Us all right, title and interest including copyright in and to such work.</p>\r\n\r\n<p>4.3\tYou agree that if We are unable, because of your unavailability, or for any other reason, to secure your signature to apply for or to pursue any application for any United States or foreign patents, mask work, copyright or trademark registrations covering the assignments to Us above, then You hereby irrevocably designates and appoints Us and your duly authorized officers and agents as your agent and attorney in fact, to act for and in your behalf and stead to execute and file any such applications and to do all other lawfully permitted acts to further the prosecution and issuance of patents, copyright, mask work and trademark registrations thereon with the same legal force and effect as if executed by your authorized agent.</p>\r\n\r\n<p>4.4\tAll Intellectual Property Rights owned by a party as of the date You agree to these Terms shall remain the property of such party and no licenses or other rights with respect to such intellectual property are granted to the other party except as expressly set forth herein.</p>\r\n\r\n<p>4.5\tNothing in these terms shall be construed as granting You any right or license under any of our Intellectual Property Right (including any rights We may have in any patents, copyrights, trademarks, service marks or any trade secrets), by implication, estoppel or otherwise, except as expressly set forth herein.</p>\r\n\r\n<h4>5.\tConfidential Information:</h4>\r\n\r\n<p>5.1\t\"Confidential Information\" shall mean any information, in whatever form, provided by Us to You with obligation of confidentiality, or designated by Us in writing as confidential, proprietary or marked with words of like import when provided to You, and information orally conveyed if We state at the time of oral conveyance or promptly thereafter that such information is confidential.  Notwithstanding anything to the contrary contained herein, information about or relating to our software, our system interfaces, our hardware and software architecture, our business, operational and marketing plans, our member lists and database, all information and technology provided by Us to You to enable You to perform your obligations hereunder, TopCoder Information, and any and all Developments shall be considered Confidential Information.</p>\r\n\r\n<p>5.2\tConfidential Information shall not include information which (a) was in your possession without confidentiality restriction prior to disclosure by Us hereunder; (b) at or after the time of disclosure by Us becomes generally available to the public through no act or omission on our part; (c) is developed by You independently of and without reference to any Confidential Information You receive from Us; or (d) has come into your possession without confidentiality restriction from a third party and such third party is under no obligation to Us to maintain the confidentiality of such information.</p>\r\n\r\n<p>5.3\tYou acknowledge the confidential and proprietary nature of Confidential Information and agree (i) to hold Confidential Information in confidence and to take all reasonable precautions to protect such Confidential Information (including, without limitation, all precautions You employ with respect to your own confidential materials), (ii) not to divulge any such Confidential Information to any third person; and (iii) not to make any use whatsoever of such Confidential Information except as expressly authorized herein.</p>\r\n\r\n<p>5.4\tIn the event You are ordered to disclose Confidential Information pursuant to a judicial or government request, requirement or order, You shall promptly notify Us and upon our request, You shall, at our expense, take reasonable steps to assist Us in contesting such request, requirement or order or in otherwise protecting our rights prior to disclosure.  </p>\r\n\r\n<p>5.5\tYou agree not to reproduce or copy by any means Confidential Information, except as reasonably required to perform the Services.  Upon termination of your performance of the Services as a review board member, your right to use Confidential Information shall immediately terminate.  In addition, upon such termination, or upon demand by Us at any time, You shall return promptly to Us or destroy, at our option, all tangible materials and computer data that disclose or embody Confidential Information. </p>\r\n\r\n<p>5.6\tYou agree that any breach of these terms by You could cause irreparable damage to Us.  In view of the difficulties of placing a monetary value on the Confidential Information, We shall have, in addition to any and all remedies of law, the right to an injunction or other equitable relief, and may be entitled to a preliminary and final injunction without the necessity of posting any bond or undertaking in connection therewith to prevent any further breach or further unauthorized use of Confidential Information.  This remedy is separate from any other remedy We may have. </p>\r\n\r\n<h4>6.\tRepresentations and Warranties:</h4>\r\n\r\n<p>6.1\tYou represent and warrant that:\r\n<ul>\r\n<li>(a) You are at least 18 years old;</li>\r\n<li>(b) You are either (i) a U.S. citizen, (ii) a lawful permanent resident of the U.S., (iii) currently residing in the U.S. with proper and valid work authorization to work as an independent contractor, or (iv) a non-U.S. citizen, not living in the U.S. and performing the Services while residing in your country of residence;</li>\r\n<li>(c)\tYou are legally able and have the power and authority to execute, deliver and perform the Services and any other agreements contemplated hereby and to consummate the transactions contemplated hereby;</li>\r\n<li>(d)\tNo impediment exists to You agreeing to these Terms, and no other agreement has been or shall be made with any third party which will interfere with its performance;</li>\r\n<li>(e)\tYou shall use Your own independently developed code, and shall not copy or include code from any other party, including publicly available \"Open Source\" code that is or may be subject to licensing restrictions, without our prior written permission; and</li>\r\n<li>(f)\tAny services performed by You as a review board member shall be performed in a professional and workmanlike manner.</li>\r\n</ul>\r\n</p>\r\n\r\n<h4>7.\tIntellectual Property Indemnification:</h4>\r\n\r\n<p>7.1\tYou shall indemnify, hold harmless and defend Us and our customers from and against any and all suits, actions, damages, costs, losses, expenses (including settlement awards and reasonable attorneys' fees) and other liabilities arising from or in connection with any claim alleging that, to your knowledge, any Development and/or Software Component violates any trade secret right, or infringes any copyright, patent, trademark, or other intellectual property interest, in any country, and shall pay all costs and damages awarded.  We shall promptly notify You of any such claim of which We are aware.</p>\r\n\r\n<p>7.2\tYour obligations shall not extend to any claim for violation or infringement resulting solely from your compliance with any specific or direct written instructions from Us if such infringement would have been avoided but for such compliance.</p>\r\n\r\n<h4>8.\tIndependent Contractors:</h4>\r\n\r\n<p>8.1\tBoth parties expressly agree and understand that You are an independent contractor and nothing herein nor the services rendered hereunder is meant, or shall be construed in any way or manner, to create a relationship of employer and employee, principal and agent, partners or any other relationship other than that of independent parties contracting with each other solely for the purpose of carrying out the provisions of these Terms.  Accordingly, You acknowledge and agree that You shall not be entitled to any benefits provided by Us to our employees.  You shall be responsible for any and all out-of-pocket expenses incurred in connection with performing the Services.  In addition, You shall have sole and exclusive responsibility for the payment of all federal, state and local income taxes, for all employment and disability insurance and for Social Security and other similar taxes with respect to any compensation provided by Us hereunder.  You further agree that if We pay or become liable for such taxes or related civil penalties or interest as a result of your failure to pay taxes or report same, or due to our failure to withhold taxes, You shall indemnify and hold us harmless for any such liability.  You shall assume and accept all responsibilities which are imposed on independent contractors by any statute, regulation, rule of law, or otherwise.  You are not our agent and are not authorized and shall not have the power or authority to bind Us or incur any liability or obligation, or act on behalf of Us.  At no time shall You represent that You are our agent, or that any of the views, advice, statements and/or information that may be provided while performing the Services are ours.</p>\r\n\r\n<p>8.2\tWe are entitled to provide You with general guidance to assist You in completing the scope of work to our satisfaction, You are ultimately responsible for directing and controlling the performance of the task and the scope of work, in accordance with these Terms.  You shall use your best efforts, energy and skill in your own name and in such manner as You see fit.</p>",
  "agreeabilityType": "Electronically-agreeable",
  "serverInformation": {
    "serverName": "Topcoder API",
    "apiVersion": "0.0.1",
    "requestDuration": 52,
    "currentTime": 1504892902498
  },
  "requesterInformation": {
    "id": "d8c441f8332161f71533f368c09aeead856e4366-K1RdFai7LCAgXVu5",
    "remoteIP": "12.34.56.78",
    "receivedParams": {
      "apiVersion": "v2",
      "termsOfUseId": "21193",
      "action": "getTermsOfUse"
    }
  }
}
